InformationRegisters/ВАТСЛогиЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВАТСЛогиЗапросов</Name>
			<Comment>Логи запросов от ВАТС</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВАТСЛогиЗапросов/Ext/ManagerModule.bsl
Процедура ЗарегистрироватьСобытие(Данные, Метод) Экспорт
	
	УстановитьПривилегированныйРежим(Истина); 
	МенеджерЗаписи					= РегистрыСведений.ВАТСЛогиЗапросов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор	= Новый УникальныйИдентификатор;
	МенеджерЗаписи.Дата				= ТекущаяДата();
	МенеджерЗаписи.Данные			= Данные;
	МенеджерЗаписи.Метод			= Метод;
	МенеджерЗаписи.Записать();
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
